In [6]:
import pandas as pd
from feature_generation import FeatureGeneration as FG

In [7]:
df = pd.read_csv('titanic.csv')

In [8]:
FG.pairwise_polynomial_combinations(df,['Age','Parch','Pclass'])

[('Age', 'Parch'), ('Age', 'Pclass'), ('Parch', 'Pclass')]

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived,Age*Parch,Age*Pclass,Parch*Pclass
0,364,3,"Asim, Mr. Adola",male,35.0,0,0,SOTON/O.Q. 3101310,7.0500,NaN,S,0,35.0,38.0,3
1,60,3,"Goodwin, Master. William Frederick",male,11.0,5,2,CA 2144,46.9000,NaN,S,0,13.0,14.0,5
2,796,2,"Otter, Mr. Richard",male,39.0,0,0,28213,13.0000,NaN,S,0,39.0,41.0,2
3,738,1,"Lesurer, Mr. Gustave J",male,35.0,0,0,PC 17755,512.3292,B101,C,1,35.0,36.0,1
4,842,2,"Mudd, Mr. Thomas Charles",male,16.0,0,0,S.O./P.P. 3,10.5000,NaN,S,0,16.0,18.0,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
841,716,3,"Soholt, Mr. Peter Andreas Lauritz Andersen",male,19.0,0,0,348124,7.6500,F G73,S,0,19.0,22.0,3
842,768,3,"Mangan, Miss. Mary",female,30.5,0,0,364850,7.7500,NaN,Q,0,30.5,33.5,3
843,73,2,"Hood, Mr. Ambrose Jr",male,21.0,0,0,S.O.C. 14879,73.5000,NaN,S,0,21.0,23.0,2
844,236,3,"Harknett, Miss. Alice Phoebe",female,NaN,0,0,W./C. 6609,7.5500,NaN,S,0,NaN,NaN,3
845,38,3,"Cann, Mr. Ernest Charles",male,21.0,0,0,A./5. 2152,8.0500,NaN,S,0,21.0,24.0,3

In [9]:
d,l =FG.pairwise_polynomial_combinations(df,['Age','Parch','Pclass'], True, True)
l

[('Age', 'Parch'), ('Age', 'Pclass'), ('Parch', 'Pclass')]

['Age*Parch', 'Age*Pclass', 'Parch*Pclass']

In [12]:
d

,PassengerId,Name,Sex,SibSp,Ticket,Fare,Cabin,Embarked,Survived,Age*Parch,Age*Pclass,Parch*Pclass
0,364,"Asim, Mr. Adola",male,0,SOTON/O.Q. 3101310,7.0500,NaN,S,0,35.0,38.0,3
1,60,"Goodwin, Master. William Frederick",male,5,CA 2144,46.9000,NaN,S,0,13.0,14.0,5
2,796,"Otter, Mr. Richard",male,0,28213,13.0000,NaN,S,0,39.0,41.0,2
3,738,"Lesurer, Mr. Gustave J",male,0,PC 17755,512.3292,B101,C,1,35.0,36.0,1
4,842,"Mudd, Mr. Thomas Charles",male,0,S.O./P.P. 3,10.5000,NaN,S,0,16.0,18.0,2
...,...,...,...,...,...,...,...,...,...,...,...,...
841,716,"Soholt, Mr. Peter Andreas Lauritz Andersen",male,0,348124,7.6500,F G73,S,0,19.0,22.0,3
842,768,"Mangan, Miss. Mary",female,0,364850,7.7500,NaN,Q,0,30.5,33.5,3
843,73,"Hood, Mr. Ambrose Jr",male,0,S.O.C. 14879,73.5000,NaN,S,0,21.0,23.0,2
844,236,"Harknett, Miss. Alice Phoebe",female,0,W./C. 6609,7.5500,NaN,S,0,NaN,NaN,3
845,38,"Cann, Mr. Ernest Charles",male,0,A./5. 2152,8.0500,NaN,S,0,21.0,24.0,3

In [13]:
df = pd.read_csv('titanic.csv')
d,l =FG.pairwise_linear_combinations(df,['Age','Parch'], True, True)
d

[('Age', 'Parch')]

,PassengerId,Pclass,Name,Sex,SibSp,Ticket,Fare,Cabin,Embarked,Survived,Age+Parch,Age-Parch
0,364,3,"Asim, Mr. Adola",male,0,SOTON/O.Q. 3101310,7.0500,NaN,S,0,35.0,35.0
1,60,3,"Goodwin, Master. William Frederick",male,5,CA 2144,46.9000,NaN,S,0,13.0,9.0
2,796,2,"Otter, Mr. Richard",male,0,28213,13.0000,NaN,S,0,39.0,39.0
3,738,1,"Lesurer, Mr. Gustave J",male,0,PC 17755,512.3292,B101,C,1,35.0,35.0
4,842,2,"Mudd, Mr. Thomas Charles",male,0,S.O./P.P. 3,10.5000,NaN,S,0,16.0,16.0
...,...,...,...,...,...,...,...,...,...,...,...,...
841,716,3,"Soholt, Mr. Peter Andreas Lauritz Andersen",male,0,348124,7.6500,F G73,S,0,19.0,19.0
842,768,3,"Mangan, Miss. Mary",female,0,364850,7.7500,NaN,Q,0,30.5,30.5
843,73,2,"Hood, Mr. Ambrose Jr",male,0,S.O.C. 14879,73.5000,NaN,S,0,21.0,21.0
844,236,3,"Harknett, Miss. Alice Phoebe",female,0,W./C. 6609,7.5500,NaN,S,0,NaN,NaN
845,38,3,"Cann, Mr. Ernest Charles",male,0,A./5. 2152,8.0500,NaN,S,0,21.0,21.0

In [14]:
l

['Age+Parch', 'Age-Parch']